tap "derailed/k9s"
tap "lifedever/tap"
tap "ybeapps/sourcegit"
brew "openssl@3"
brew "aria2"
brew "bash"
brew "btop"
brew "checkstyle"
brew "cmake"
brew "cmake-docs"
brew "colima", restart_service: :changed
brew "ctags"
brew "curl"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "dos2unix"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "libssh"
brew "ffmpegthumbnailer"
brew "fx"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "glslang"
brew "gnupg"
brew "goaccess"
brew "hadolint"
brew "pkgconf"
brew "highlight"
brew "himalaya"
brew "imagemagick"
brew "jq"
brew "killport"
brew "kubernetes-cli"
brew "libxml2"
brew "libyaml"
brew "make"
brew "maven"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mole"
brew "mongodb-atlas-cli"
brew "tree-sitter"
brew "neovim"
brew "nss"
brew "openslide"
brew "opentofu"
brew "pandoc"
brew "pandoc-crossref"
brew "poppler"
brew "postgresql@17", restart_service: :changed
brew "qpdf"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruff"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sniffnet"
brew "sqlfluff"
brew "stylua"
brew "syncthing", restart_service: :changed
brew "task"
brew "taskwarrior-tui"
brew "texlive"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "uncrustify"
brew "uv"
brew "vim"
brew "vips"
brew "whistle"
brew "yamllint"
brew "yazi"
brew "zsh-autosuggestions"
brew "derailed/k9s/k9s"
cask "adrive"
cask "antigravity"
cask "betterdisplay"
cask "blender"
cask "calibre"
cask "dbeaver-community"
cask "dorso"
cask "drawio"
cask "dropbox"
cask "duplicati"
cask "easydict"
cask "espanso"
cask "feishu"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "httpie-desktop"
cask "kap"
cask "kdiff3"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "losslesscut"
cask "lulu"
cask "maccy"
cask "macfuse"
cask "macpass"
cask "marta"
cask "meld"
cask "nutstore"
cask "ollama-app"
cask "openinterminal-lite"
cask "qbittorrent"
cask "qq"
cask "rectangle"
cask "shottr"
cask "sioyek"
cask "ybeapps/sourcegit/sourcegit"
cask "tencent-lemon"
cask "thor"
cask "wechat"
cask "wechatwork"
cask "wezterm"
cask "wpsoffice-cn"
cask "youdaonote"
cask "yuanbao"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "kilocode.kilo-code"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "cmd/go"
go "github.com/rogpeppe/godef"
go "cmd/gofmt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
uv "fastapi"
