tap "charmbracelet/tap"
tap "derailed/k9s"
tap "jesseduffield/lazydocker"
tap "ybeapps/sourcegit"
brew "openssl@3"
brew "gnupg"
brew "aerc"
brew "aria2"
brew "asciinema"
brew "bash"
brew "biome"
brew "block-goose-cli"
brew "btop"
brew "checkstyle"
brew "cmake"
brew "colima", restart_service: :changed
brew "ctags"
brew "curl"
brew "deno"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "dos2unix"
brew "dprint"
brew "fastfetch"
brew "fd"
brew "libssh"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "gcc"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "glslang"
brew "graphviz"
brew "gum"
brew "hadolint"
brew "pkgconf"
brew "highlight"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libxml2"
brew "libyaml"
brew "make"
brew "maven"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mongodb-atlas-cli"
brew "mosh"
brew "nss"
brew "ollama", restart_service: :changed
brew "openslide"
brew "opentofu"
brew "pandoc"
brew "poppler"
brew "postgresql@17", restart_service: :changed
brew "qpdf"
brew "ripgrep"
brew "qwen-code"
brew "redis", restart_service: :changed
brew "ruff"
brew "rustscan"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "sniffnet"
brew "sqlfluff"
brew "stylua"
brew "syncthing", restart_service: :changed
brew "task"
brew "texlive"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "ttyd"
brew "uncrustify"
brew "uv"
brew "vim"
brew "vips"
brew "w3m"
brew "whistle"
brew "xan"
brew "xh"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "charmbracelet/tap/crush"
brew "derailed/k9s/k9s"
brew "jesseduffield/lazydocker/lazydocker"
cask "adrive"
cask "affinity"
cask "alacritty"
cask "android-platform-tools"
cask "awesun"
cask "balenaetcher"
cask "blender"
cask "calibre"
cask "charles"
cask "clash-verge-rev"
cask "claude-code"
cask "codex"
cask "copilot-cli"
cask "dbgate"
cask "dropbox"
cask "duplicati"
cask "easydict"
cask "feishu"
cask "floorp"
cask "fontforge-app"
cask "google-chrome"
cask "httpie-desktop"
cask "iina"
cask "jordanbaird-ice"
cask "kap"
cask "kdiff3"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "localsend"
cask "losslesscut"
cask "lulu"
cask "maccy"
cask "macfuse"
cask "macpass"
cask "meld"
cask "mucommander"
cask "obs"
cask "obsidian"
cask "onedrive"
cask "openinterminal-lite"
cask "pika"
cask "qbittorrent"
cask "rectangle"
cask "shottr"
cask "sourcegit"
cask "stretchly"
cask "super-productivity"
cask "syntax-highlight"
cask "tabby"
cask "tailscale-app"
cask "telegram-desktop"
cask "tencent-lemon"
cask "tencent-meeting"
cask "thor"
cask "trae-cn"
cask "utm"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "wechat"
cask "wechatwebdevtools"
cask "wechatwork"
cask "windterm"
cask "wpsoffice-cn"
cask "youdaonote"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "usernamehw.errorlens"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "cmd/go"
go "github.com/rogpeppe/godef"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
cargo "atuin"
cargo "dprint"
