# command-line utilities

brew "aria2"
brew "btop"
brew "cmake"
brew "ctags"
brew "dprint"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gcc"
brew "git-cola"
brew "git-lfs"
brew "glslang"
brew "go"
brew "gpg"
brew "gromgit/fuse/ntfs-3g-mac"
brew "hadolint"
brew "highlight"
brew "imagemagick"
brew "jq"
brew "keyviz"
brew "lazygit"
brew "libxml2"
brew "lihaoyun6/tap/quickrecorder"
brew "make"
brew "mkcert"
brew "neovim"
brew "node"
brew "nss"
brew "nvm"
brew "openssl"
brew "pandoc"
brew "poppler"
brew "prettier"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "scrcpy"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sqlfluff"
brew "stylelint"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "yamllint"
brew "yazi"
brew "zoxide"

# apps

cask "android-studio"
cask "another-redis-desktop-manager"
cask "audacity"
cask "balenaetcher"
cask "blender"
cask "calibre"
cask "charles"
cask "cherry-studio"
cask "clion"
cask "cryptomator"
cask "dbeaver-community"
cask "drawio"
cask "duplicati"
cask "easydict"
cask "espanso"
cask "feishu"
cask "flameshot"
cask "flux"
cask "freecad"
cask "freeplane"
cask "ghostty"
cask "gimp"
cask "gitx"
cask "google-chrome"
cask "handbrake"
cask "httpie"
cask "inkscape"
cask "iina"
cask "joplin"
cask "jordanbaird-ice"
cask "kap"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "kekaexternalhelper"
cask "localsend"
cask "loop"
cask "lulu"
cask "maccy"
cask "macdown"
cask "macpass"
cask "macfuse"
cask "mongodb-compass"
cask "mounty"
cask "motrix"
cask "musicbrainz-picard"
cask "microsoft-onenote"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "ollama"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "orbstack"
cask "pika"
cask "qbittorrent"
cask "rectangle"
cask "rider"
cask "shotcut"
cask "shottr"
cask "skim"
cask "stretchly"
cask "switchhosts"
cask "syncthing"
cask "syntax-highlight"
cask "telegram-desktop"
cask "tencent-lemon"
cask "textmate"
cask "thor"
cask "thunderbird"
cask "trae"
cask "utm"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
cask "wechat"
cask "wechatwork"
cask "wechatwebdevtools"
cask "wezterm"
cask "windterm"
cask "wireshark"
cask "wpsoffice-cn"
cask "xld"
cask "zed"

# fonts

cask "font-maple-mono-cn"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"

# fuse-t
tap macos-fuse-t/homebrew-cask
brew "fuse-t"
brew "fuse-t-sshfs"