tap "charmbracelet/tap"
tap "lihaoyun6/tap"
tap "sst/tap"
brew "openssl@3"
brew "aria2"
brew "bash"
brew "bazelisk"
brew "biome"
brew "btop"
brew "cmake"
brew "ctags"
brew "curl"
brew "dos2unix"
brew "dprint"
brew "fastfetch"
brew "fd"
brew "libssh"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-lfs"
brew "glslang"
brew "gnupg"
brew "hadolint"
brew "highlight"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libxml2"
brew "libyaml"
brew "make"
brew "maven"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mongodb-atlas-cli"
brew "mosh"
brew "nss"
brew "pandoc"
brew "pkgconf"
brew "poppler"
brew "postgresql@17", restart_service: :changed
brew "qemu"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "ruff"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "sniffnet"
brew "sqlfluff"
brew "stylua"
brew "texlive"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "whistle"
brew "xh"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
cask "adrive"
cask "alacritty"
cask "alt-tab"
cask "android-platform-tools"
cask "android-studio"
cask "balenaetcher"
cask "blender"
cask "calibre"
cask "charles"
cask "dbgate"
cask "duplicati"
cask "easydict"
cask "feishu"
cask "flameshot"
cask "fontforge-app"
cask "gimp"
cask "gitx"
cask "google-chrome"
cask "httpie-desktop"
cask "iina"
cask "inkscape"
cask "jordanbaird-ice"
cask "kap"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "kekaexternalhelper"
cask "localsend"
cask "losslesscut"
cask "lulu"
cask "lunarbar"
cask "maccy"
cask "macfuse"
cask "meld"
cask "monitorcontrol"
cask "obsidian"
cask "ollama-app"
cask "onedrive"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "orbstack"
cask "pika"
cask "qbittorrent"
cask "rectangle"
cask "stretchly"
cask "switchhosts"
cask "syncthing-app"
cask "syntax-highlight"
cask "tabby"
cask "telegram-desktop"
cask "tencent-lemon"
cask "thor"
cask "visual-studio-code"
cask "wechat"
cask "wechatwebdevtools"
cask "wechatwork"
cask "wetype"
cask "windterm"
cask "wireshark-app"
cask "wpsoffice-cn"
cask "xmind"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "augment.vscode-augment"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "james-yu.latex-workshop"
vscode "marscode.marscode-extension"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "tencent-cloud.coding-copilot"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
