tap "macos-fuse-t/cask"
tap "oven-sh/bun"
tap "sst/tap"
brew "openssl@3"
brew "aria2"
brew "asdf"
brew "bazelisk"
brew "btop"
brew "cmake"
brew "code-server"
brew "ctags"
brew "dprint"
brew "fastfetch"
brew "fd"
brew "libssh"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gcc"
brew "git-lfs"
brew "glslang"
brew "gnupg"
brew "go"
brew "hadolint"
brew "highlight"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libxml2"
brew "libyaml"
brew "make"
brew "minikube"
brew "mise"
brew "mkcert"
brew "mosh"
brew "nss"
brew "pandoc"
brew "poppler"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "sniffnet"
brew "sqlfluff"
brew "stylua"
brew "tealdeer"
brew "texlive"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "yamllint"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "oven-sh/bun/bun"
brew "sst/tap/opencode"
cask "adrive"
cask "alacritty"
cask "android-platform-tools"
cask "android-studio"
cask "another-redis-desktop-manager"
cask "audacity"
cask "balenaetcher"
cask "blender"
cask "bluestacks"
cask "calibre"
cask "charles"
cask "clash-verge-rev"
cask "cryptomator"
cask "dbeaver-community"
cask "drawio"
cask "duplicati"
cask "easydict"
cask "ente-auth"
cask "espanso"
cask "feishu"
cask "firefox"
cask "flameshot"
cask "font-maple-mono-cn"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "fontforge-app"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "ghostty"
cask "gimp"
cask "gitx"
cask "google-chrome"
cask "handbrake-app"
cask "httpie-desktop"
cask "iina"
cask "inkscape"
cask "jordanbaird-ice"
cask "kap"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "kekaexternalhelper"
cask "libreoffice"
cask "localsend"
cask "lulu"
cask "maccy"
cask "macfuse"
cask "macpass"
cask "marta"
cask "microsoft-outlook"
cask "mongodb-compass"
cask "musicbrainz-picard"
cask "obsidian"
cask "ollama-app"
cask "onedrive"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "orbstack"
cask "picgo"
cask "pika"
cask "qbittorrent"
cask "rectangle"
cask "shotcut"
cask "skim"
cask "stats"
cask "stretchly"
cask "sunloginclient"
cask "switchhosts"
cask "syncthing-app"
cask "syntax-highlight"
cask "telegram-desktop"
cask "tencent-lemon"
cask "thor"
cask "trae"
cask "utm"
cask "visual-studio-code"
cask "wechat"
cask "wechatwebdevtools"
cask "wechatwork"
cask "windterm"
cask "wireshark-app"
cask "wpsoffice-cn"
cask "xld"
cask "xmind"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
