tap "gromgit/fuse"
tap "lihaoyun6/tap"
tap "macos-fuse-t/cask"
brew "openssl@3"
brew "aria2"
brew "btop"
brew "cmake"
brew "ctags"
brew "dprint"
brew "fastfetch"
brew "fd"
brew "libssh"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gcc"
brew "git-cola"
brew "git-lfs"
brew "glslang"
brew "gnupg"
brew "go"
brew "hadolint"
brew "highlight"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libxml2"
brew "libyaml"
brew "make"
brew "maven"
brew "mkcert"
brew "neovim"
brew "node"
brew "nss"
brew "nvm"
brew "pandoc"
brew "pnpm", link: false
brew "poppler"
brew "prettier"
brew "qemu"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "scrcpy"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sqlfluff"
brew "stylelint"
brew "stylua"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "w3m"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "gromgit/fuse/ntfs-3g-mac"
cask "android-studio"
cask "another-redis-desktop-manager"
cask "audacity"
cask "balenaetcher"
cask "blender"
cask "calibre"
cask "charles"
cask "cherry-studio"
cask "clion"
cask "cryptomator"
cask "dbeaver-community"
cask "drawio"
cask "duplicati"
cask "easydict"
cask "espanso"
cask "feishu"
cask "flameshot"
cask "flux"
cask "font-maple-mono-cn"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "fontforge"
cask "freecad"
cask "freeplane"
cask "fuse-t"
cask "fuse-t-sshfs"
cask "ghostty"
cask "gimp"
cask "gitx"
cask "google-chrome"
cask "handbrake"
cask "httpie"
cask "iina"
cask "inkscape"
cask "joplin"
cask "jordanbaird-ice"
cask "kap"
cask "keepassxc"
cask "keepingyouawake"
cask "keka"
cask "kekaexternalhelper"
cask "localsend"
cask "loop"
cask "lulu"
cask "maccy"
cask "macdown"
cask "macfuse"
cask "macpass"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-onenote"
cask "mongodb-compass"
cask "motrix"
cask "mounty"
cask "musicbrainz-picard"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "ollama"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "orbstack"
cask "pika"
cask "qbittorrent"
cask "quickrecorder"
cask "rectangle"
cask "rider"
cask "shotcut"
cask "shottr"
cask "skim"
cask "stretchly"
cask "switchhosts"
cask "syncthing"
cask "syntax-highlight"
cask "telegram-desktop"
cask "tencent-lemon"
cask "tencent-meeting"
cask "textmate"
cask "thor"
cask "thunderbird"
cask "trae"
cask "trae-cn"
cask "utm"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "webstorm"
cask "wechat"
cask "wechatwebdevtools"
cask "wechatwork"
cask "wezterm"
cask "windterm"
cask "wireshark"
cask "wpsoffice-cn"
cask "xld"
vscode "1yib.rust-bundle"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "augment.vscode-augment"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
